final/app/controllers/after_login_controller.rb

SELECT "studs".* FROM "studs"
---
  def index
  	  @studs = Stud.all

SELECT  "studs".* FROM "studs" WHERE "studs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "studs" SET "appr" = ?, "updated_at" = ? WHERE "studs"."id" = ?  [["appr", nil], ["updated_at", 2016-11-26 23:34:16 UTC], ["id", 2]]
---
def update

 params[:stud].each {|key, value| Stud.find(key.to_i).update(appr: value[:appr].to_i) }