final/app/views/after_login/index.html.erb

 	        <% if studs.id%40 == 6 %>
 	         <%if Stud.find(studs.id - 6).appr==1 %>
---
SELECT  "studs".* FROM "studs" WHERE "studs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]